; PopDrop 配置示例（UTF-16LE + BOM + CRLF）
; 建议优先使用“PopDrop 设置…”。手工编辑时请保留六个布局锚点。

; <PopDrop:area 1>
[General]
ConfigVersion=31
Hotkey=F2
StartupEnabled=0
; 可选：主快捷键连续按两次直达指定工作区 ID
DoubleHotkeyWorkspaceId=workspace-text-default
; 主快捷键单击目标：LastWorkspace=上次关闭时工作区，DefaultWorkspace=默认工作区（Order 首项）
MainHotkeyWorkspaceMode=LastWorkspace
; 记录最近使用的文件工作区，供兼容回退与文本块返回使用
LastFileWorkspaceId=workspace-default
OpenFileMode=DoubleClick
; PopDrop（默认、推荐）| System；按住 Shift 打开另一个菜单
DefaultContextMenu=PopDrop
EscapeHidesPanel=1
MaxFilesPerFolder=10
DisplayScope=FilesOnly
FolderTimeMode=DirectoryModified
IncludeSubfolders=0
SortMode=ModifiedDesc
FilterMode=All
FileExtensions=
ThumbnailSize=106
ThumbnailHorizontalGap=18
ThumbnailVerticalGap=4
; 分栏在系统原生边界基础上增加的上下留白（DIP，0–32）
FileViewGroupTopSpacing=6
FileViewGroupBottomSpacing=8
ThumbnailTextLines=2
; 文本块卡片宽高（DIP）；增大高度会自动容纳更多行文字
TextBlockCardWidth=155
TextBlockCardHeight=52
WindowWidth=686
WindowHeight=586
ViewMode=Thumbnail
ShowRecentSidebar=0
RecentFileCount=12
UiScale=100
CachePath=
ContentUpdateMode=Fast
ConsistencyCheckMinutes=60
ThumbnailPolicy=Full
WindowMode=temporary
LastOpenProgramDir=
LastTransferTargetDir=
TransferFavoritesInitialized=1
GlobalExcludedNamesInitialized=1
[ExternalTransfer]
EnablePublicUrlFallback=1
AllowHttp=0
MaxConcurrent=3
ShowCompletionNotifications=1

[FileManager]
; WindowsShell（默认）| DirectoryOpus | TotalCommander | XYplorer | DoubleCommander | Files | FreeCommander
Provider=WindowsShell
; 第三方程序分别使用 dopusrt.exe、TOTALCMD64.EXE/TOTALCMD.EXE、XYplorer.exe、doublecmd.exe、Files 官方启动程序或 FreeCommander.exe
Executable=

[Preview]
; <PopDrop:PreviewHelp>
; 文件内容预览。高级限制仅建议在排查兼容性问题时修改。
; 图片、文本、Markdown 和表格可直接生成；PDF/DOCX 使用隔离 Worker。
Enabled=1
Side=Auto
HoverDelayMs=350
SwitchDelayMs=50
LeaveGraceMs=140
PreviousPreviewHoldMs=500
BackgroundColor=#000000
BackgroundOpacity=255
KeyboardDelayMs=250
Width=400
CacheEnabled=1
CacheStartAfterHiddenSeconds=10
CacheMaxMB=256
CacheMaxItems=1000
CacheItemMaxKB=2048
CacheUnreferencedDays=7
DirectImageMaxFileMB=64
DirectImageMaxEdge=65535
DirectImageMaxPixelsMP=160
DirectImageMaxExpandedMB=256
DocumentEnabled=1
PdfEnabled=0
ShowFileInfo=1

[QuickPreview]
; <PopDrop:QuickPreviewHelp>
; Off | Seer | QuickLook。只有能力检测成功后才接管空格键。
ExternalQuickPreviewProvider=Off
SeerIntegrationEnabled=0
; QuickLook 桌面版或便携版 QuickLook.exe 的绝对路径。
QuickLookPath=
[NoiseFilter]


; <PopDrop:NoiseFilterHelp>
; Enabled：总开关；1=排除噪音文件，0=全部显示。
; HideHidden：是否排除具有 Hidden 属性的文件。
; HideSystem：是否排除具有 System 属性的文件。
; HideTemporaryAttribute：是否排除具有 Temporary 属性的文件。
; HideIncompleteDownloads：是否排除浏览器、迅雷、aria2 与 BT 客户端的未完成下载。
; CustomPatternCount：下方 CustomPatternNNN 自定义文件名规则的数量。
; 以上选项只影响 PopDrop 显示，不会删除、移动或修改真实文件。
Enabled=1
HideHidden=1
HideSystem=1
HideTemporaryAttribute=1
HideIncompleteDownloads=1
CustomPatternCount=0

; <PopDrop:area 2>
; 旧版本兼容快照。v0.9 起运行时来源以第三区的工作区配置为准。
[Folders]

[PinnedFiles]
; v0.9.0 旧版共享固定项迁移入口；迁移后固定项按工作区保存在第三区。

; <PopDrop:area 3>
[Workspaces]
Order=workspace-default,workspace-text-default
Active=workspace-default
PinnedScopeVersion=1

[Workspace:workspace-default]
Name=默认工作区
Type=Files
Hotkey=
SourceOrder=source-documents,source-downloads

[WorkspacePinned:workspace-default]

[Workspace:workspace-text-default]
Name=文本块
Type=Text
Hotkey=
SourceOrder=

[WorkspacePinned:workspace-text-default]

[Source:source-documents]
WorkspaceId=workspace-default
Name=文档
Path=%USERPROFILE%\Documents
Mode=Files
MaxFilesPerFolder=10
IncludeSubfolders=0
DisplayScope=FilesOnly
FolderTimeMode=DirectoryModified
SortMode=ModifiedDesc
FilterMode=Inherit
FileExtensions=
StripOrderPrefix=0
HideExtensions=0
OpenFileMode=Inherit
NoiseFilterMode=Inherit

[Source:source-downloads]
WorkspaceId=workspace-default
Name=下载
Path=%USERPROFILE%\Downloads
Mode=Files
MaxFilesPerFolder=12
IncludeSubfolders=0
DisplayScope=FilesOnly
FolderTimeMode=DirectoryModified
SortMode=ModifiedDesc
FilterMode=Exclude
FileExtensions=.tmp,.part,.crdownload,.download
StripOrderPrefix=0
HideExtensions=0
OpenFileMode=Inherit
NoiseFilterMode=Inherit

; v0.8 及更早版本的稳定来源索引，保留为空以便人工降级检查。
[Sources]
Order=

; <PopDrop:area 4>
[OpenApps]
Order=
; 应用示例：先把上方 Order= 改为 Order=7z，再取消以下配置段各行的分号。
;
; [OpenApp:7z]
; Path=C:\Program Files\7-Zip\7zFM.exe
; Name=7-Zip
; Icon=C:\Program Files\7-Zip\7zFM.exe
; Extensions=.zip,.7z
; Enabled=1
; ShowInOpenMenu=1
; ActionOrder=extract-folder,compress-7z
;
; [OpenAppAction:7z:extract-folder]
; Name=解压到同名文件夹
; Executable=C:\Program Files\7-Zip\7z.exe
; TargetTypes=Files
; ExecutionMode=PerItem
; Extensions=.zip,.7z,.rar,.tar.gz
; RequireCommonFolder=1
; WorkingDirectoryMode=Folder
; WorkingDirectory=
; Confirm=0
; Enabled=1
; ArgCount=3
; Arg001=x
; Arg002={item}
; Arg003=-o{folder}\{stem}
;
; [OpenAppAction:7z:compress-7z]
; Name=压缩为 7z
; Executable=C:\Program Files\7-Zip\7z.exe
; TargetTypes=Both
; ExecutionMode=Batch
; Extensions=
; RequireCommonFolder=1
; WorkingDirectoryMode=Folder
; WorkingDirectory=
; Confirm=1
; Enabled=1
; ArgCount=3
; Arg001=a
; Arg002={folder}\archive-{datetime}.7z
; Arg003={items}

; <PopDrop:area 5>
[TransferFavorites]
Path001=%USERPROFILE%\Desktop
Path002=%USERPROFILE%\Downloads

[TransferFavoriteLabels]
Path001=桌面
Path002=下载

[RecentTargets]

; <PopDrop:area 6>
[ExcludedFolderNames]
Name001=.git
Name002=.svn
Name003=.hg
Name004=node_modules
Name005=__pycache__
